axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_adc.c
/**
*\*\name    ADC_INTFlag_Status_Clear.
*\*\fun     Clear ADC flag Status.
*\*\param   adc_flag :
*\*\          - ADC_INT_FLAG_AWDG
*\*\          - ADC_INT_FLAG_ENDC
*\*\          - ADC_INT_FLAG_JENDC
*\*\          - ADC_INT_FLAG_ENDCA
*\*\          - ADC_INT_FLAG_JENDCA
*\*\return  none
**/
void ADC_INTFlag_Status_Clear(uint8_t adc_flag)
{
    /* Clear the selected ADC flag Status */
    ADC->STS &= ~(uint32_t)adc_flag;
}

/**
*\*\name    ADC_Flag_Status_Clear.
*\*\fun     Clear ADC flag Status.
*\*\param   adc_flag :
*\*\          - ADC_FLAG_AWDG
*\*\          - ADC_FLAG_ENDC
*\*\          - ADC_FLAG_JENDC
*\*\          - ADC_FLAG_JSTR
*\*\          - ADC_FLAG_STR
*\*\          - ADC_FLAG_ENDCA
*\*\          - ADC_FLAG_JENDCA
*\*\return  none
**/
void ADC_Flag_Status_Clear(uint8_t adc_flag)
{
    /* Clear the selected ADC flag Status */
    ADC->STS &= ~(uint32_t)adc_flag;
}
/**
*\*\name    ADC_Vbat_Monitor_Enable.
*\*\fun     Enable ADC Vbat monitor.
*\*\return  none
**/
void ADC_Vbat_Monitor_Enable(void)
{
    /* Enable Vbat monitor */
    ADC->CTRL3 |= ADC_VBAT_MONITOR_ENABLE;
    /* Enable Vbat monitor in AFEC register */
    _EnVref1p2()
}

/**
*\*\name    ADC_Vbat_Monitor_Disable.
*\*\fun     Disable ADC Vbat monitor.
*\*\return  none
**/
void ADC_Vbat_Monitor_Disable(void)
{
    /* Disable Vbat monitor */
    ADC->CTRL3 &= ADC_VBAT_MONITOR_DISABLE;
    /* Disable Vbat monitor in AFEC register */
    _DisVref1p2()
}

/**
*\*\name    ADC_Deep_Power_Mode_Enable.
*\*\fun     Enable ADC deep power mode.
*\*\return  none
**/
void ADC_Deep_Power_Mode_Enable(void)
{   
    /* Set the ADC_CTRL3 DPWMOD bit to enable ADC deep power mode */
    ADC->CTRL3 |= ADC_DEEP_POWER_ENABLE;
}

/**
*\*\name    ADC_Deep_Power_Mode_Disable.
*\*\fun     Disable ADC deep power mode.
*\*\return  none
**/
void ADC_Deep_Power_Mode_Disable(void)
{   
    /* Clear the ADC_CTRL3 DPWMOD bit to disable ADC deep power mode */
    ADC->CTRL3 &= ADC_DEEP_POWER_DISABLE;
}

/**
*\*\name    ADC_AHB_Clock_Mode_Config.
*\*\fun     Configures the ADC AHB clock mode.
*\*\return  none
**/
void ADC_AHB_Clock_Mode_Config(void)
{   
    /* Clear the ADC_CTRL3 CKMOD bit */
    ADC->CTRL3 &= ADC_CLOCK_AHB;  
}

/**
*\*\name    ADC_PLL_Clock_Mode_Config.
*\*\fun     Configures the ADC PLL clock mode.
*\*\return  none
**/
void ADC_PLL_Clock_Mode_Config(void)
{   
    /* Set the ADC_CTRL3 CKMOD bit to select clock mode*/
    ADC->CTRL3 |= ADC_CLOCK_PLL;  
}

/**
*\*\name    ADC_Calibration_Auto_Load_Enable.
*\*\fun     Enable ADC Calibration Auto Load mode.
*\*\return  none
**/
void ADC_Calibration_Auto_Load_Enable(void)
{   
    /* Set the ADC_CTRL3 CALALD bit to enable or disable ADC Calibration Auto Load */
    ADC->CTRL3 |= ADC_CALALD_ENABLE;
}

/**
*\*\name    ADC_Calibration_Auto_Load_Disable.
*\*\fun     Disable ADC Calibration Auto Load mode.
*\*\return  none
**/
void ADC_Calibration_Auto_Load_Disable(void)
{   
    /* Clear the ADC_CTRL3 CALALD bit */
    ADC->CTRL3 &= ADC_CALALD_DISABLE;
}

/**
*\*\name    ADC_Differential_Mode_Enable.
*\*\fun     Enable ADC Calibration Auto Load mode.
*\*\return  none
**/
void ADC_Differential_Mode_Enable(void)
{   
    /* Set the ADC_CTRL3 CALDIF bit */
    ADC->CTRL3 |= ADC_CALDIF_ENABLE;
}

/**
*\*\name    ADC_Differential_Mode_Disable.
*\*\fun     Disable ADC Calibration Auto Load mode.
*\*\return  none
**/
void ADC_Differential_Mode_Disable(void)
{   
    /* Clear the ADC_CTRL3 CALDIF bit */
    ADC->CTRL3 &= ADC_CALDIF_DISABLE;
}

/**
*\*\name    ADC_Data_Resolution_Config
*\*\fun     Configures ADC data resolution conversion.
*\*\param   resbit :
*\*\          - ADC_RST_BIT_12  
*\*\          - ADC_RST_BIT_10  
*\*\          - ADC_RST_BIT_8    
*\*\          - ADC_RST_BIT_6    
*\*\return  none
**/
void ADC_Data_Resolution_Config(uint32_t resbit)
{   
    /* Clear the ADC_CTRL3 RES[1:0] bit */
    ADC->CTRL3 &= ADC_RES_MSK;
    /* Set the ADC_CTRL3 RES[1:0] bit to select data resolution*/
    ADC->CTRL3 |= resbit;
}

/**
*\*\name    ADC_Sample_Time_Level_Config.
*\*\fun     Configures the level of sample time.
*\*\param   sample_time_level :
*\*\          - ADC_SAMPLE_LEVEL_0
*\*\          - ADC_SAMPLE_LEVEL_1
*\*\return  none
**/
void ADC_Sample_Time_Level_Config(uint32_t sample_time_level)
{   
    /* Clear the ADC_SAMPT3 SAMSEL bit */
    ADC->SAMPT3 &= ADC_SAMPLE_LEVEL_MASK;
    /* Set the ADC_SAMPT3 SAMSEL bit to select sample time*/
    ADC->SAMPT3 |= sample_time_level;  
}

/**
*\*\name    ADC_Initializes_Ex.
*\*\fun     Initializes the ADC according to ADC_initstructEx.
*\*\param   ADC_initstructEx :
*\*\          - VbatMinitEn
*\*\          - DeepPowerModEn    
*\*\          - JendcIntEn
*\*\          - EndcIntEn    
*\*\          - ClkMode    
*\*\          - CalAtuoLoadEn
*\*\          - DifModCal
*\*\          - ResBit    
*\*\          - SampSecondStyle
*\*\return  none
**/
void ADC_Initializes_Ex(ADC_InitTypeEx* ADC_initstructEx)
{
    if (ADC_initstructEx->VbatMinitEn)
        ADC_Vbat_Monitor_Enable();
    else
        ADC_Vbat_Monitor_Disable();
    
    if (ADC_initstructEx->DeepPowerModEn)
        ADC_Deep_Power_Mode_Enable();
    else
        ADC_Deep_Power_Mode_Disable();

    if (ADC_initstructEx->JendcIntEn)
        ADC_Interrupts_Enable(ADC_INT_JENDCA);
    else
        ADC_Interrupts_Disable(ADC_INT_JENDCA);

    if (ADC_initstructEx->EndcIntEn)
        ADC_Interrupts_Enable(ADC_INT_ENDCA);
    else
        ADC_Interrupts_Disable(ADC_INT_ENDCA);
    
    if (ADC_initstructEx->ClkMode == ADC_CKMOD_PLL)
        ADC_PLL_Clock_Mode_Config();
    else
        ADC_AHB_Clock_Mode_Config();

    if (ADC_initstructEx->CalAtuoLoadEn)
        ADC_Calibration_Auto_Load_Enable();
    else
        ADC_Calibration_Auto_Load_Disable();

    if (ADC_initstructEx->DifModCal)
        ADC_Differential_Mode_Enable();
    else
        ADC_Differential_Mode_Disable();

    ADC_Data_Resolution_Config(ADC_initstructEx->ResBit);
    ADC_Sample_Time_Level_Config(ADC_initstructEx->SampSecondStyle);

