axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_adc.c
}

/**
*\*\name    ADC_Initializes_StructureEx.
*\*\fun     Fills each ADC_initstructEx member with its default value.
*\*\param   ADC_initstructEx :
*\*\          - VbatMinitEn
*\*\          - DeepPowerModEn    
*\*\          - JendcIntEn
*\*\          - EndcIntEn    
*\*\          - ClkMode    
*\*\          - CalAtuoLoadEn
*\*\          - DifModCal
*\*\          - ResBit    
*\*\          - SampSecondStyle
*\*\return  none
**/
void ADC_Initializes_StructureEx(ADC_InitTypeEx* ADC_initstructEx)
{
    /* Reset ADC init structure_ex parameters values */
    /* Initialize the VbatMinitEn member */
    ADC_initstructEx->VbatMinitEn       = DISABLE;
    /* initialize the DeepPowerModEn member */
    ADC_initstructEx->DeepPowerModEn    = DISABLE;
    /* Initialize the JendcIntEn member */
    ADC_initstructEx->JendcIntEn        = DISABLE;
    /* initialize the EndcIntEn member */
    ADC_initstructEx->EndcIntEn         = DISABLE;
    /* Initialize the ClkMode member */
    ADC_initstructEx->ClkMode           = ADC_CKMOD_AHB;
    /* initialize the CalAtuoLoadEn member */
    ADC_initstructEx->CalAtuoLoadEn     = DISABLE;
    /* Initialize the DifModCal member */
    ADC_initstructEx->DifModCal         = DISABLE;
    /* initialize the ResBit member */
    ADC_initstructEx->ResBit            = ADC_RST_BIT_12;
    /* Initialize the SampSecondStyle member */
    ADC_initstructEx->SampSecondStyle   = ADC_SAMPLE_LEVEL_0;
}

/**
*\*\name    ADC_Bypass_Calibration_Enable
*\*\fun     Enable ADC Calibration Bypass Load .
*\*\return  none
**/
void ADC_Bypass_Calibration_Enable(void)
{
    /* Set the ADC_CTRL3 BPCAL bit */
    ADC->CTRL3 |= ADC_BYPASSES_CAL_ENABLE;
}

/**
*\*\name    ADC_Bypass_Calibration_Disable
*\*\fun     Disable ADC Calibration Bypass Load .
*\*\return  none
**/
void ADC_Bypass_Calibration_Disable(void)
{
    /* Clear the ADC_CTRL3 BPCAL bit */
    ADC->CTRL3 &= ADC_BYPASSES_CAL_DISABLE;
}

/**
*\*\name    ADC_Differential_Channels_Config.
*\*\fun     Configures the ADC Differential mode.
*\*\param   DifChs :
*\*\          - ADC_DIFSEL_CHS_1    
*\*\          - ADC_DIFSEL_CHS_2    
*\*\          - ADC_DIFSEL_CHS_3    
*\*\          - ADC_DIFSEL_CHS_4    
*\*\          - ADC_DIFSEL_CHS_5    
*\*\          - ADC_DIFSEL_CHS_6   
*\*\          - ADC_DIFSEL_CHS_7   
*\*\return  none
**/
void ADC_Differential_Channels_Config(uint32_t difchs)
{
    /* Clear the ADC_DIFSEL DIFSEL[18:1] bit */
    ADC->DIFSEL &= ADC_DIFSEL_CHS_MASK;
    /* Set the ADC_DIFSEL DIFSEL[18:1] bit */
    ADC->DIFSEL |= difchs;
}

/**
*\*\name    ADC_Clock_Mode_Config
*\*\fun     Configures the ADCHCLK prescaler.
*\*\param   ADC_clkmode:
*\*\          - ADC_CKMOD_AHB
*\*\          - ADC_CKMOD_PLL
*\*\param   RCC_ADCHCLKprescaler:
*\*\          - RCC_ADCHCLK_DIV1 
*\*\          - RCC_ADCHCLK_DIV2 
*\*\          - RCC_ADCHCLK_DIV4 
*\*\          - RCC_ADCHCLK_DIV6 
*\*\          - RCC_ADCHCLK_DIV8 
*\*\          - RCC_ADCHCLK_DIV10 
*\*\          - RCC_ADCHCLK_DIV12 
*\*\          - RCC_ADCHCLK_DIV16 
*\*\          - RCC_ADCHCLK_DIV32

*\*\          - RCC_ADCPLLCLK_DIV1 
*\*\          - RCC_ADCPLLCLK_DIV2 
*\*\          - RCC_ADCPLLCLK_DIV4 
*\*\          - RCC_ADCPLLCLK_DIV6 
*\*\          - RCC_ADCPLLCLK_DIV8
*\*\          - RCC_ADCPLLCLK_DIV10
*\*\          - RCC_ADCPLLCLK_DIV12 
*\*\          - RCC_ADCPLLCLK_DIV16 
*\*\          - RCC_ADCPLLCLK_DIV32 
*\*\          - RCC_ADCPLLCLK_DIV64 
*\*\          - RCC_ADCPLLCLK_DIV128 
*\*\          - RCC_ADCPLLCLK_DIV256 
*\*\return  none
**/
void ADC_Clock_Mode_Config(ADC_CKMOD ADC_clkmode, uint32_t RCC_ADCHCLKprescaler)
{
    RCC_ADC_Hclk_Enable();
    if(ADC_clkmode == ADC_CKMOD_AHB)
    {
        RCC_ADC_PLL_Clock_Disable();
        RCC_ADC_Hclk_Config(RCC_ADCHCLKprescaler);
        ADC_AHB_Clock_Mode_Config();
    }
    else
    {
        RCC_ADC_PLL_Clock_Prescaler_Enable(RCC_ADCHCLKprescaler);
        ADC_PLL_Clock_Mode_Config();
    }
}

